class Main {
    /**
     * 「コレクション」とは、複数の要素の集まりを指す。
     * 「コレクションフレームワーク」とは、
     * その要素の集まりを操作・管理するための方法を定義したアーキテクチャ
     * ・Collectionインタフェース
     * 　　　　List、Setインタフェースの親。
     * ・Listインタフェース
     * 　　　　格納される要素において、順番を持つインタフェース。
     * 　　　　インデックス番号によって要素を操作するメソッドが定義されている。
     * ・Setインタフェース
     * 　　　　格納されている要素において、重複を許可しないインタフェース。
     * ・SortedSetインタフェース
     * 　　　　Setインタフェースを継承する。
     * 　　　　Setの特性に加え、要素をルールに基づきソートするというメソッドが定義されている。
     * ・Mapインタフェース
     * 　　　　格納される要素において、順番を持つインタフェース。
     * 　　　　インデックス番号によって、要素を操作するメソッドが定義されている。
     * ・SortedMapインタフェース
     * 　　　　Mapインタフェースを継承する。
     * 　　　　Mapの特性に加え、キーをルールに基づきソートする
     */
}